-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 05, 2025 at 07:46 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `maskansazan`
--

-- --------------------------------------------------------

--
-- Table structure for table `project_members`
--

CREATE TABLE `project_members` (
  `id` int(11) NOT NULL,
  `share` varchar(10) DEFAULT NULL,
  `introducer` varchar(50) DEFAULT NULL,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(100) DEFAULT NULL,
  `main_member` varchar(50) DEFAULT NULL,
  `declared_share` varchar(10) DEFAULT NULL,
  `national_code` varchar(20) DEFAULT NULL,
  `father_name` varchar(50) DEFAULT NULL,
  `birth_certificate` varchar(20) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `birth_place` varchar(50) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `project_members`
--

INSERT INTO `project_members` (`id`, `share`, `introducer`, `first_name`, `last_name`, `main_member`, `declared_share`, `national_code`, `father_name`, `birth_certificate`, `birth_date`, `birth_place`, `phone`) VALUES
(1, '0/5', NULL, 'فاطمه', 'یزدی', 'اصلی', '1/2', '0321663195', 'حسین', '1174', '1385-04-14', 'کرج', '9120201412'),
(2, '0/5', NULL, 'ابوالفضل', 'بلندیان کاشی', 'اصلی', '1/4', '0054569109', 'رحمت اله', '2468', '1348-07-25', 'تهران', '09126028115'),
(3, '1', 'پویا', 'راحله السادات', 'میرعلی‌آبادی', 'اصلی', '1', '0060168420', 'سید محمد', '30313', '1359-11-10', 'تهران', NULL),
(4, '0/5', NULL, 'هاشم', 'حاجی‌قاسمی', 'اصلی', '1/4', '0070646767', 'محمد', '1115', '1354-02-28', 'تهران', '09125102151'),
(5, '0/5', NULL, 'نرگس', 'حاجی‌قاسمی', 'اصلی', '0/5', '0055096263', 'محمد', '1658', '1348-06-15', 'تهران', '09352522240'),
(6, '0/25', NULL, 'یوسف', 'حاجی‌قاسمی', 'اصلی', '0/25', '0061846899', 'محمد', '9335', '1357-04-08', 'تهران', '09121547173'),
(7, '0/25', NULL, 'اعظم', 'خوانین‌زاده', 'اصلی', '0/25', '0018270107', 'محمد مهدی', '0018270107', '1374-05-12', 'تهران', '09102111760'),
(8, '1', NULL, 'هادی', 'مرادی', 'اصلی', '1', '0491973780', 'اسمعیل', '671', '1359-06-20', 'شهر ری', '09125403424'),
(9, '1', NULL, 'مرتضی', 'دزفولیان', 'اصلی', '1', '1755696159', 'محمد کاظم', '340', '1343-01-01', 'اهواز', '09123009715'),
(10, '1', NULL, 'امیدعلی', 'حیدری', 'اصلی', '1', '4869689812', 'محمد علی', '240', '1361-03-03', 'کلاله', '09124437723'),
(11, '1', NULL, 'حمیده', 'احمدی', 'اصلی', '1', '0071325182', 'قربانعلی', '268', '1355-01-11', 'تهران', '09120163417'),
(12, '1', NULL, 'زهرا', 'کریمی دهکردی', 'اصلی', '1', '4621836994', 'رحمن', '70', '1364-01-01', 'شهرکرد', '09133823296'),
(13, '1', 'کاشانی', 'سیما', 'صالح', 'اصلی', '1', '4419778543', 'حسن', '7768', '1366-02-14', 'دورود', '09909347718'),
(14, '1', NULL, 'نرجس', 'خسروی', 'اصلی', '1', '1141148560', 'علی', '649', '0000-00-00', 'خمینی شهر', '09337308401'),
(15, '1', NULL, 'بهاره', 'خسروی', 'اصلی', '1', '1142315711', 'علی', '9083', '1366-01-03', 'خمینی شهر', NULL),
(16, '1', 'پارسا', 'فرشته', 'چگینی‌نژاد', 'اصلی', '1', '4899883315', 'مسعود', '2746', '1365-03-04', 'ساوجبلاغ', '09124606586'),
(17, '0/5', NULL, 'کاظم', 'عبدالهی سریزدی', 'اصلی', '0/5', '0069028176', 'حسن', '5572', '1355-06-13', 'تهران', '09121016084'),
(18, '0/5', NULL, 'مهدی', 'آذری کوشکی', 'اصلی', '0/5', '0068404689', 'حسن', '4086', '1362-04-22', 'تهران', '09124960987'),
(19, '1', NULL, 'حمیدرضا', 'نامدار ده‌بزرگی', 'اصلی', '1', '2296719880', 'هدایت', '123', '1342-02-10', 'شیراز', '09123875587'),
(20, '0/5', NULL, 'جواد', 'غفوری', 'اصلی', '0/5', '0071980687', 'حسن', '7358', '1361-06-29', 'تهران', '09191249062'),
(21, '0/5', NULL, 'رضا', 'علی‌نژاد', 'اصلی', '0/5', '0067870740', 'حکمعلی', '1838', '1358-01-22', 'تهران', '09127270499'),
(22, '1', NULL, 'محمد', 'نظری‌فر', 'اصلی', '1', '4819842889', 'علی', '1007', '1364-06-30', 'باغ ملک', '09163192973'),
(23, '1', NULL, 'جواد', 'هاشمی', 'اصلی', '1', '0035217863', 'ابراهیم', '12430', '1343-01-01', 'تهران', '09122975217'),
(24, '0/5', NULL, 'مرتضی', 'محبی', 'اصلی', '0/5', '0015236595', 'محمد', '0015236595', '1371-08-23', 'تهران', '09368066679'),
(25, '0/5', NULL, 'ریحانه', 'خوانین‌زاده', 'اصلی', '0/5', '0019695896', 'محمد مهدی', '0019695896', '1375-09-30', 'تهران', '09210954261'),
(26, '0/5', 'کشاورز', 'مریم', 'صادقی', 'اصلی', '0/5', '0056981813', 'علی', '2128', '1351-04-01', 'تهران', '09125786840'),
(27, '0/5', 'شیری', 'زهرا', 'کرمی', 'اصلی', '0/5', '0370394674', 'احمد', '0370394674', '1369-06-16', 'قم', NULL),
(28, '1', NULL, 'لیلا', 'کریمی دهکردی', 'اصلی', '1', '4621640763', 'رحمن', '376', '1358-01-15', 'شهرکرد', '09126277389'),
(29, '1', NULL, 'نرگس', 'پرویززاده', 'اصلی', '1', '0061976441', 'حسن', '9425', '1358-06-25', 'تهران', '09120286097'),
(30, '1', NULL, 'معصومه', 'یوسفی', 'اصلی', '1', '0047809485', 'علی', '504', '1348-03-01', 'تهران', NULL),
(31, '1', NULL, 'سید محمد', 'حسینی', 'اصلی', '1', '4899430061', 'سید شعبان', '205', '1361-09-25', 'ساوجبلاغ', '09193667691'),
(32, '1', 'رمضانی', 'زهرا', 'فیض', 'اصلی', '1', '0056922418', 'مسیب', '533', '1351-01-06', 'تهران', NULL),
(33, '1', NULL, 'شمس الملوک', 'علی‌آبادی', 'اصلی', '1', '0934464901', 'شکر اله', '6357', '1348-09-28', 'مشهد', '09129328956'),
(34, '1', NULL, 'عبدالناصر', 'یوسف‌‍زاده', 'اصلی', '1', '5359926538', 'اسداله', '28', '1354-01-12', 'کوهبنان', '09021143210'),
(35, '0/5', NULL, 'محمد', 'مرادی', 'اصلی', '0/5', '2803597853', 'نصرت اله', '449', '1367-09-15', 'خوی', '09125159538'),
(36, '0/5', NULL, 'موسی', 'مرادی', 'اصلی', '0/5', '1219894966', 'نصرت اله', '1287', '1365-01-30', 'گلپایگان', '09125638736'),
(37, '1', NULL, 'مجید', 'خاکساران خوش', 'اصلی', '1', '0053965906', 'محمد', '7526', '1350-06-01', 'تهران', '09122466076'),
(38, '0/25', NULL, 'ابراهیم', 'شمس اسفند‌آبادی', 'اصلی', '0/25', '5039764545', 'احمد', '606', '1362-11-01', 'ابرکوه', '09132542675'),
(39, '0/25', NULL, 'مرتضی', 'کلانتر چاهوکی', 'اصلی', '0/25', '4433644625', 'محمد', '9721', '1366-06-04', 'یزد', NULL),
(40, '0/25', NULL, 'شقایق', 'اکبری', 'اصلی', '0/25', '0021414564', 'اصغر', '0021414564', '1377-06-04', 'تهران', NULL),
(41, '0/25', NULL, 'مجید', 'ناصرییان', 'اصلی', '0/25', '4072439975', 'حسن', '1375', '1361-09-03', 'خرم‌آباد', '09161611718'),
(42, NULL, NULL, 'سحر', 'حسنی', 'پیش خرید از مالک', '0/1', '0323401211', 'نصرت اله', '26131', '1367-04-29', 'کرج', '09126721402'),
(43, NULL, NULL, 'حماسه', 'مرادیان‌ریزی', 'پیش خرید از مالک', '0/1', '0310911389', 'احمد', '0310911389', '1372-03-25', 'کرج', NULL),
(44, NULL, 'یاشار', 'نفیسه', 'حیدری', 'پیش خرید از مالک', '0/1', '0519987616', 'داود', '25', '1367-03-16', 'آشتیان', NULL),
(45, NULL, NULL, 'بهنام', 'شکری', 'پیش خرید از مالک', '0/1', '0323951287', 'جعفر', '8810', '1366-03-24', 'کرج', NULL),
(46, NULL, NULL, 'آئین', 'بلندیان کاشی', 'صوری 1', '0/1', '00151187561', 'ابوالفضل', '00151187561', '1385-04-14', 'تهران', '09194711950'),
(47, NULL, NULL, 'همایون', 'بلندیان کاشی', 'صوری 2', '0/1', '0019107358', 'ابوالفضل', '0019107358', '1375-03-15', 'تهران', '09383488242'),
(48, NULL, NULL, 'مرتضی', 'افشارنیا', 'صوری 3', '0/1', '4219778543', 'حسن', '7768', '1366-02-14', 'دورود', '09909347718'),
(49, NULL, NULL, 'محمد', 'حاجی‌قاسمی', 'صوری 4', '0/1', '4469807249', 'حیدر', '43', '1324-04-06', 'مهریز', '09126208392'),
(50, NULL, NULL, 'میترا', 'بختیاری', 'صوری 5', '0/1', '0323172288', 'حجت اله', '2154', '1362-01-11', 'کرج', '09125718726'),
(51, NULL, NULL, 'فهیمه السادات', 'میرکریم‌پور', 'صوری 6', '0/1', '0013306278', 'سید محمد', '0013306278', '1370-02-04', 'تهران', '09191688231'),
(52, NULL, NULL, 'عطیه', 'صالحی شهرابی', 'صوری 7', '0/1', '1263473997', 'محمد', '16151', '1367-10-27', 'کاشان', NULL),
(53, NULL, NULL, 'راضیه', 'حاجی‌قاسمی', 'صوری 8', '0/1', '0059503807', 'محمد', '11301', '1351-06-20', 'تهران', NULL),
(54, NULL, NULL, 'بهنام', 'عارف‌ طاهر', 'صوری 9', '0/1', '0040236749', 'عابدین', '2286', '1346-01-01', 'تهران', '09124548345');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `project_members`
--
ALTER TABLE `project_members`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
