-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: May 13, 2026 at 02:16 PM
-- Server version: 8.0.34
-- PHP Version: 8.4.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `maskanhb_maskansazan`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` int UNSIGNED NOT NULL,
  `username` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `password_hash` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `status` enum('active','inactive') COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'active',
  `remember_token_hash` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `remember_token_expiry` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `username`, `password_hash`, `status`, `remember_token_hash`, `remember_token_expiry`) VALUES
(1, 'admin', '$2y$10$nwmFMP6PlKaW3FL2VWVH/uEPvXWtx18qqL3d/SBNWRPZ9RS7xNJ2K', 'active', '259287187b49ed08479c18077cb9141e7a1b7d329450b92ca5c4e23be5c953d6', '2026-01-12 17:34:45');

-- --------------------------------------------------------

--
-- Table structure for table `captcha_sessions`
--

CREATE TABLE `captcha_sessions` (
  `session_id` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `captcha_text` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `captcha_time` int NOT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_agent` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `captcha_sessions`
--

INSERT INTO `captcha_sessions` (`session_id`, `captcha_text`, `captcha_time`, `ip_address`, `user_agent`, `created_at`) VALUES
('0e1aa0d86a41d7cb778855747bbadfec', '8A87VE', 1765268052, '178.131.26.25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36', '2025-12-09 08:14:12'),
('c0019d77fc13278fdd94b341b11b01fb', '2MATTA', 1765268119, '178.131.26.25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36', '2025-12-09 08:15:19');

-- --------------------------------------------------------

--
-- Table structure for table `cheques_transactions`
--

CREATE TABLE `cheques_transactions` (
  `id` int UNSIGNED NOT NULL,
  `cheque_number` varchar(30) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `cheque_date` varchar(10) COLLATE utf8mb4_persian_ci NOT NULL,
  `amount` bigint NOT NULL,
  `bank_name` varchar(50) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `member_name` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `national_code` varchar(15) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `account_holder_name` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `reason` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `receiver_name` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `receiver_national_code` varchar(15) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_persian_ci,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `cheques_transactions`
--

INSERT INTO `cheques_transactions` (`id`, `cheque_number`, `cheque_date`, `amount`, `bank_name`, `member_name`, `national_code`, `account_holder_name`, `reason`, `receiver_name`, `receiver_national_code`, `description`, `created_at`) VALUES
(119, '1872/366265/59', '1403/11/15', 750000000, 'ملت', 'بهاره خسروی', '1142315711', 'نرجس خسروی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(120, '1872/366263/36', '1404/03/15', 750000000, 'ملت', 'بهاره خسروی', '1142315711', 'نرجس خسروی', 'جواز', 'رسالت ابوالفضل', '0054569109', 'چک به مبلغ 150000000 تومان', '2026-02-08 08:32:47'),
(121, '1872/366266/45', '1403/12/15', 750000000, 'ملت', 'بهاره خسروی', '1142315711', 'نرجس خسروی', 'جواز', 'کوهی', '0322264881', 'چک به مبلغ 150000000 تومان', '2026-02-08 08:32:47'),
(122, '1872/366267/31', '1404/01/15', 750000000, 'ملت', 'بهاره خسروی', '1142315711', 'نرجس خسروی', 'جواز', 'رسالت هاشم', '0070646767', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(123, '1872/366268/17', '1404/02/15', 750000000, 'ملت', 'بهاره خسروی', '1142315711', 'نرجس خسروی', 'جواز', 'رسالت ابوالفضل', '0054569109', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(124, '982-9/914124', '1403/10/15', 750000000, 'رفاه', 'جواد غفوری و شرکا', '0071980687', 'جواد غفوری', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(125, '12-9831/086767', '1403/11/15', 750000000, 'ملی', 'جواد غفوری و شرکا', '0067870740', 'رضا علی نژاد', 'جواز', 'رسالت کریمپور', NULL, NULL, '2026-02-08 08:32:47'),
(126, '12-9831/086768', '1404/01/15', 750000000, 'ملی', 'جواد غفوری و شرکا', '0067870740', 'رضا علی نژاد', 'جواز', 'رسالت همایون', NULL, NULL, '2026-02-08 08:32:47'),
(127, '12-9831/086769', '1404/03/15', 750000000, 'ملی', 'جواد غفوری و شرکا', '0067870740', 'رضا علی نژاد', 'جواز', 'رسالت همایون', NULL, NULL, '2026-02-08 08:32:47'),
(128, '982009/914125', '1403/12/15', 750000000, 'رفاه', 'جواد غفوری و شرکا', '0071980687', 'جواد غفوری', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(129, '400021/507901', '1404/02/15', 750000000, 'رفاه', 'جواد غفوری و شرکا', '0071980687', 'جواد غفوری', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(130, '12-9756/219619', '1403/10/15', 750000000, 'ملی', 'جواد هاشمی', '0035217863', 'جواد هاشمی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(131, '12-9756/219620', '1403/11/15', 750000000, 'ملی', 'جواد هاشمی', '0035217863', 'جواد هاشمی', 'جواز', 'رسالت کریمپور', NULL, NULL, '2026-02-08 08:32:47'),
(132, '12-9756/219621', '1403/12/15', 750000000, 'ملی', 'جواد هاشمی', '0035217863', 'جواد هاشمی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(133, '0124/092174', '1403/10/15', 750000000, 'سپه', 'راحله میر علی آبادی', '0060168420', 'محسن پویا', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(134, '0124/092175', '1403/11/15', 750000000, 'سپه', 'راحله میر علی آبادی', '0060168420', 'محسن پویا', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(135, '07-0130/616389', '1403/12/15', 750000000, 'ملی', 'راحله میر علی آبادی', '0060168420', 'سعید پویا', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(136, '07-0130/616390', '1404/01/15', 750000000, 'ملی', 'راحله میر علی آبادی', '0060168420', 'سعید پویا', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(137, '07-0130/616391', '1404/02/15', 750000000, 'ملی', 'راحله میر علی آبادی', '0060168420', 'سعید پویا', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(138, '07-0130/616392', '1404/03/15', 750000000, 'ملی', 'راحله میر علی آبادی', '0060168420', 'سعید پویا', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(139, '12-0202/799038', '1404/01/15', 750000000, 'ملی', 'زهرا فیض', '0056922418', 'زهرا فیض', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(140, '12-0202/799039', '1404/02/15', 750000000, 'ملی', 'زهرا فیض', '0056922418', 'زهرا فیض', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(141, '12-0202/799040', '1404/03/15', 750000000, 'ملی', 'زهرا فیض', '0056922418', 'زهرا فیض', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(142, '12-0202/799035', '1403/10/15', 750000000, 'ملی', 'زهرا فیض', '0056922418', 'زهرا فیض', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(143, '12-0202/799037', '1403/12/15', 750000000, 'ملی', 'زهرا فیض', '0056922418', 'زهرا فیض', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(144, '12-0202/799036', '1403/11/15', 750000000, 'ملی', 'زهرا فیض', '0056922418', 'زهرا فیض', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(145, '549855', '1403/11/01', 750000000, 'تجارت', 'زهرا کریمی دهکردی', '4621836994', 'زهرا کریمی دهکردی', 'جواز', 'نیل قاز', '4911499192', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(146, '549856', '1403/10/01', 750000000, 'تجارت', 'زهرا کریمی دهکردی', '4621836994', 'زهرا کریمی دهکردی', 'جواز', NULL, NULL, 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(147, '549854', '1403/12/01', 750000000, 'تجارت', 'زهرا کریمی دهکردی', '4621836994', 'زهرا کریمی دهکردی', 'جواز', 'کوهی', '0322264881', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(148, '549853', '1404/01/01', 750000000, 'تجارت', 'زهرا کریمی دهکردی', '4621836994', 'زهرا کریمی دهکردی', 'جواز', 'رسالت هاشم', '0070646767', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(149, '549852', '1404/02/01', 750000000, 'تجارت', 'زهرا کریمی دهکردی', '4621836994', 'زهرا کریمی دهکردی', 'جواز', 'رسالت ابوالفضل', '0054569109', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(150, '549851', '1404/03/01', 750000000, 'تجارت', 'زهرا کریمی دهکردی', '4621836994', 'زهرا کریمی دهکردی', 'جواز', 'رسالت هاشم', '0070646767', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(151, '12-0307/225284', '1404/02/15', 750000000, 'ملی', 'سید محمد حسینی', '4899430061', 'سید محمد حسینی', 'جواز', 'رسالت هاشم', '0070646767', 'هاشم در بانک ملی نقد کرد', '2026-02-08 08:32:47'),
(152, '12-0307/225283', '1404/01/15', 750000000, 'ملی', 'سید محمد حسینی', '4899430061', 'سید محمد حسینی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(153, '12-0307/225282', '1403/11/15', 750000000, 'ملی', 'سید محمد حسینی', '4899430061', 'سید محمد حسینی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(154, '12-0307/225281', '1403/12/15', 750000000, 'ملی', 'سید محمد حسینی', '4899430061', 'سید محمد حسینی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(155, '12-0307/225280', '1403/10/15', 750000000, 'ملی', 'سید محمد حسینی', '4899430061', 'سید محمد حسینی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(156, '12-0307/225285', '1404/03/15', 750000000, 'ملی', 'سید محمد حسینی', '4899430061', 'سید محمد حسینی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(157, '40011/460086', '1403/10/15', 750000000, 'سامان', 'سیما صالح', '0534691374', 'فرید شاهد کاشانی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(158, '40011/460088', '1403/12/15', 750000000, 'سامان', 'سیما صالح', '0534691374', 'فرید شاهد کاشانی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(159, '40011/460089', '1404/01/15', 750000000, 'سامان', 'سیما صالح', '0534691374', 'فرید شاهد کاشانی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(160, '40011/460090', '1404/02/15', 750000000, 'سامان', 'سیما صالح', '0534691374', 'فرید شاهد کاشانی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(161, '40011/460091', '1404/03/15', 750000000, 'سامان', 'سیما صالح', '0534691374', 'فرید شاهد کاشانی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(162, '40011/460087', '1403/11/15', 750000000, 'سامان', 'سیما صالح', '0534691374', 'فرید شاهد کاشانی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(163, '161007', '1403/12/15', 750000000, 'ملی', 'شمس الملوک علی آبادی', '0934464901', 'شمس الملوک علی آبادی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(164, '161008', '1404/01/15', 750000000, 'ملی', 'شمس الملوک علی آبادی', '0934464901', 'شمس الملوک علی آبادی', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(165, '161009', '1404/02/15', 750000000, 'ملی', 'شمس الملوک علی آبادی', '0934464901', 'شمس الملوک علی آبادی', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(166, '161010', '1404/03/15', 750000000, 'ملی', 'شمس الملوک علی آبادی', '0934464901', 'شمس الملوک علی آبادی', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(167, '161006', '1403/11/15', 750000000, 'ملی', 'شمس الملوک علی آبادی', '0934464901', 'شمس الملوک علی آبادی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(168, '14032/453504', '1403/10/15', 750000000, 'پارسیان', 'عبدالناصر یوسف زاده', '5359926538', 'عبدالناصر یوسف زاده', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(169, '14032/453506', '1403/12/15', 750000000, 'پارسیان', 'عبدالناصر یوسف زاده', '5359926538', 'عبدالناصر یوسف زاده', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(170, '14032/453507', '1404/01/15', 750000000, 'پارسیان', 'عبدالناصر یوسف زاده', '5359926538', 'عبدالناصر یوسف زاده', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(171, '14032/453508', '1404/02/15', 750000000, 'پارسیان', 'عبدالناصر یوسف زاده', '5359926538', 'عبدالناصر یوسف زاده', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(172, '14032/453509', '1404/03/15', 750000000, 'پارسیان', 'عبدالناصر یوسف زاده', '5359926538', 'عبدالناصر یوسف زاده', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(173, '14032/453505', '1403/11/15', 750000000, 'پارسیان', 'عبدالناصر یوسف زاده', '5359926538', 'عبدالناصر یوسف زاده', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(174, '1820/149511/31', '1404/01/15', 375000000, 'ملت', 'کاظم عبدالهی وشرکا', '0069028176', 'کاظم عبدالهی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(175, '1820/149512/17', '1404/02/15', 375000000, 'ملت', 'کاظم عبدالهی وشرکا', '0069028176', 'کاظم عبدالهی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(176, '1820/149513/54', '1404/03/15', 375000000, 'ملت', 'کاظم عبدالهی وشرکا', '0069028176', 'کاظم عبدالهی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(177, '1512/997648', '1403/10/15', 375000000, 'صادرات', 'کاظم عبدالهی وشرکا', '0069028176', 'کاظم عبدالهی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(178, '1512/997650', '1403/12/15', 375000000, 'صادرات', 'کاظم عبدالهی وشرکا', '0069028176', 'کاظم عبدالهی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(179, '1512/997649', '1403/11/15', 375000000, 'صادرات', 'کاظم عبدالهی وشرکا', '0069028176', 'کاظم عبدالهی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(180, '40322/996313', '1403/12/15', 375000000, 'سامان', 'کاظم عبدالهی وشرکا', '0068404689', 'مهدی آذری', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(181, '40322/996314', '1404/01/15', 375000000, 'سامان', 'کاظم عبدالهی وشرکا', '0068404689', 'مهدی آذری', 'جواز', 'رسالت هاشم', '0054569109', NULL, '2026-02-08 08:32:47'),
(182, '40322/996315', '1404/02/15', 375000000, 'سامان', 'کاظم عبدالهی وشرکا', '0068404689', 'مهدی آذری', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(183, '40322/996316', '1404/03/15', 375000000, 'سامان', 'کاظم عبدالهی وشرکا', '0068404689', 'مهدی آذری', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(184, '40322/996312', '1403/11/15', 375000000, 'سامان', 'کاظم عبدالهی وشرکا', '0068404689', 'مهدی آذری', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(185, '549855', '1403/11/01', 750000000, 'تجارت', 'لیلا کریمی دهکردی', '4621640763', 'زهرا کریمی دهکردی', 'جواز', 'نیل قاز', '4911499192', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(186, '549856', '1403/10/01', 750000000, 'تجارت', 'لیلا کریمی دهکردی', '4621640763', 'زهرا کریمی دهکردی', 'جواز', NULL, NULL, 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(187, '549854', '1403/12/01', 750000000, 'تجارت', 'لیلا کریمی دهکردی', '4621640763', 'زهرا کریمی دهکردی', 'جواز', 'کوهی', '0322264881', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(188, '549853', '1404/01/01', 750000000, 'تجارت', 'لیلا کریمی دهکردی', '4621640763', 'زهرا کریمی دهکردی', 'جواز', 'رسالت هاشم', '0070646767', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(189, '549852', '1404/02/01', 750000000, 'تجارت', 'لیلا کریمی دهکردی', '4621640763', 'زهرا کریمی دهکردی', 'جواز', 'رسالت ابوالفضل', '0054569109', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(190, '549851', '1404/03/01', 750000000, 'تجارت', 'لیلا کریمی دهکردی', '4621640763', 'زهرا کریمی دهکردی', 'جواز', 'رسالت هاشم', '0070646767', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(191, '1200314/109754', '1403/10/15', 750000000, 'ملی', 'مجید خاکساران', '0053965906', 'مجید خاکساران', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(192, '1200314/109756', '1403/12/15', 750000000, 'ملی', 'مجید خاکساران', '0053965906', 'مجید خاکساران', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(193, '1200314/109757', '1404/01/15', 750000000, 'ملی', 'مجید خاکساران', '0053965906', 'مجید خاکساران', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(194, '1200314/109758', '1404/02/15', 750000000, 'ملی', 'مجید خاکساران', '0053965906', 'مجید خاکساران', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(195, '1200314/109759', '1404/03/15', 750000000, 'ملی', 'مجید خاکساران', '0053965906', 'مجید خاکساران', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(196, '1200314/109755', '1403/11/15', 750000000, 'ملی', 'مجید خاکساران', '0053965906', 'مجید خاکساران', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(197, '400030/250938', '1403/10/15', 750000000, 'رفاه', 'محمد نظری فر', '4819842889', 'فاطمه عسگری', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(198, '400030/250940', '1404/01/15', 750000000, 'رفاه', 'محمد نظری فر', '4819842889', 'فاطمه عسگری', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(199, '400030/250941', '1404/03/15', 750000000, 'رفاه', 'محمد نظری فر', '4819842889', 'فاطمه عسگری', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(200, '400030/250942', '1404/02/15', 750000000, 'رفاه', 'محمد نظری فر', '4819842889', 'فاطمه عسگری', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(201, '400030/250943', '1403/12/15', 750000000, 'رفاه', 'محمد نظری فر', '4819842889', 'فاطمه عسگری', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(202, '400030/250939', '1403/11/15', 750000000, 'رفاه', 'محمد نظری فر', '4819842889', 'فاطمه عسگری', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(203, '12-0210/029428', '1403/10/15', 750000000, 'ملی', 'مرتضی دزفولیان', '1755696159', 'مرتضی دزفولیان', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(204, '12-0210/029430', '1403/12/15', 750000000, 'ملی', 'مرتضی دزفولیان', '1755696159', 'مرتضی دزفولیان', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(205, '12-0210/029429', '1403/11/15', 750000000, 'ملی', 'مرتضی دزفولیان', '1755696159', 'مرتضی دزفولیان', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(206, '1097/734866', '1403/10/15', 750000000, 'پاسارگاد', 'مرتضی محبی', '0015236595', 'مرتضی محبی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(207, '1097/734867', '1403/11/15', 750000000, 'پاسارگاد', 'مرتضی محبی', '0015236595', 'مرتضی محبی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(208, '1097/734868', '1403/12/15', 750000000, 'پاسارگاد', 'مرتضی محبی', '0015236595', 'مرتضی محبی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(209, '1021/644148', '1403/10/15', 750000000, 'سرمایه', 'معصومه یوسفی', '0047809485', 'محسن یوسفی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(210, '1021/644150', '1403/12/15', 750000000, 'سرمایه', 'معصومه یوسفی', '0047809485', 'محسن یوسفی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(211, '1021/644164', '1404/02/15', 750000000, 'سرمایه', 'معصومه یوسفی', '0047809485', 'محسن یوسفی', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(212, '1021/644165', '1404/03/15', 750000000, 'سرمایه', 'معصومه یوسفی', '0047809485', 'محسن یوسفی', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(213, '1021/644149', '1403/11/15', 750000000, 'سرمایه', 'معصومه یوسفی', '0047809485', 'محسن یوسفی', 'جواز', 'نیل قاز', '4911499192', NULL, '2026-02-08 08:32:47'),
(214, '9001/056891', '1403/10/15', 750000000, 'صادرات', 'موسی مرادی و شرکا', '1219894966', 'موسی مرادی', 'جواز', NULL, NULL, NULL, '2026-02-08 08:32:47'),
(215, '9001/056893', '1403/12/15', 750000000, 'صادرات', 'موسی مرادی و شرکا', '1219894966', 'موسی مرادی', 'جواز', 'کوهی', '0322264881', NULL, '2026-02-08 08:32:47'),
(216, '9001/056894', '1404/01/15', 750000000, 'صادرات', 'موسی مرادی و شرکا', '1219894966', 'موسی مرادی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(217, '9001/056895', '1404/02/15', 750000000, 'صادرات', 'موسی مرادی و شرکا', '1219894966', 'موسی مرادی', 'جواز', 'رسالت هاشم', '0070646767', NULL, '2026-02-08 08:32:47'),
(218, '9001/056896', '1404/03/15', 750000000, 'صادرات', 'موسی مرادی و شرکا', '1219894966', 'موسی مرادی', 'جواز', 'رسالت ابوالفضل', '0054569109', NULL, '2026-02-08 08:32:47'),
(219, '9001/056892', '1403/11/15', 750000000, 'صادرات', 'موسی مرادی و شرکا', '1219894966', 'موسی مرادی', 'جواز', 'نیل قاز', '4911499192', 'چک به مبلغ 150000000 تومان', '2026-02-08 08:32:47'),
(220, '1872/366264/22', '1403/11/15', 750000000, 'ملت', 'نرجس خسروی', '1141148560', 'نرجس خسروی', 'جواز', 'نیل قاز', '4911499192', 'چک به مبلغ 150000000 تومان', '2026-02-08 08:32:47'),
(221, '1872/366263/36', '1404/03/15', 750000000, 'ملت', 'نرجس خسروی', '1141148560', 'نرجس خسروی', 'جواز', 'رسالت ابوالفضل', '0054569109', 'چک به مبلغ 150000000 تومان', '2026-02-08 08:32:47'),
(222, '1872/366267/31', '1404/01/15', 750000000, 'ملت', 'نرجس خسروی', '1141148560', 'نرجس خسروی', 'جواز', 'رسالت هاشم', '0070646767', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(223, '1872/366268/17', '1404/02/15', 750000000, 'ملت', 'نرجس خسروی', '1141148560', 'نرجس خسروی', 'جواز', 'رسالت ابوالفضل', '0054569109', 'چک به مبلغ 150 میلیون تومان', '2026-02-08 08:32:47'),
(224, '1872/366266/45', '1403/12/15', 750000000, 'ملت', 'نرجس خسروی', '1141148560', 'نرجس خسروی', 'جواز', 'کوهی', '0322264881', 'چک به مبلغ 150000000 تومان', '2026-02-08 08:32:47');

-- --------------------------------------------------------

--
-- Table structure for table `cheque_transactions`
--

CREATE TABLE `cheque_transactions` (
  `id` int NOT NULL,
  `cheque_number` varchar(50) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `cheque_date` varchar(10) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `amount` decimal(15,2) DEFAULT NULL,
  `bank_name` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `member_name` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `account_owner` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `national_code` varchar(20) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `purpose` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `receiver_name` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `receiver_national_code` varchar(20) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `description` text COLLATE utf8mb3_persian_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

--
-- Dumping data for table `cheque_transactions`
--

INSERT INTO `cheque_transactions` (`id`, `cheque_number`, `cheque_date`, `amount`, `bank_name`, `member_name`, `account_owner`, `national_code`, `purpose`, `receiver_name`, `receiver_national_code`, `description`) VALUES
(51, '12-0202/799032', '1403/07/15', 3000000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'زمین', 'نیل قاز', '4911499192', ''),
(52, '12-0202/799033', '1403/08/15', 2500000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'زمین', 'نیل قاز', '4911499192', ''),
(53, '12-0202/799034', '1403/09/15', 2500000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'زمین', NULL, NULL, ''),
(54, '12-0202/799041', '1404/05/15', 1000000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'ساخت', 'شیری', NULL, ''),
(55, '12-0202/799042', '1404/08/15', 1000000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'ساخت', 'شیری', NULL, ''),
(56, '12-0202/799043', '1404/11/15', 1000000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'ساخت', NULL, NULL, ''),
(57, '12-0202/799044', '1405/02/15', 1000000000.00, 'ملی', 'زهرا فیض', 'زهرا فیض', '0056922418', 'ساخت', NULL, NULL, ''),
(58, '9304/670822', '1404/05/15', 500000000.00, 'صادرات', 'زهرا کرمی', 'سعید شیری', '0370394674', 'ساخت', 'کوهی', NULL, ''),
(59, '783607', '1403/07/15', 6000000000.00, 'ملی', 'زهرا  ولیلا کریمی دهکردی', 'یوسف قادری', '3621836994', 'زمین', 'نیل قاز', '4911499192', ''),
(60, '783607', '1403/08/15', 5000000000.00, 'ملی', 'زهرا و لیلا کریمی دهکردی', 'یوسف قادری', '3621836994', 'زمین', 'نیل قاز', '4911499192', ''),
(61, '549855', '1403/11/01', 1500000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'جواز', 'نیل قاز', '4911499192', ''),
(62, '783607', '1403/09/15', 5000000000.00, 'ملی', 'زهرا و لیلا کریمی دهکردی', 'یوسف قادری', '3621836994', 'زمین', NULL, NULL, ''),
(63, '549856', '1403/10/01', 1500000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'جواز', NULL, NULL, ''),
(64, '549854', '1403/12/01', 1500000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'جواز', NULL, NULL, ''),
(65, '549853', '1404/01/01', 1500000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'جواز', NULL, NULL, ''),
(66, '549852', '1404/02/01', 1500000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'جواز', NULL, NULL, ''),
(67, '549851', '1404/03/01', 1500000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'جواز', NULL, NULL, ''),
(68, '3394/549859', '1404/05/15', 2000000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'ساخت', 'کوهی', NULL, ''),
(69, '3394/549860', '1404/08/15', 2000000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'ساخت', 'حسن سلطانیان', NULL, ''),
(70, '3394/549861', '1404/11/15', 2000000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'ساخت', NULL, NULL, ''),
(71, '3394/549862', '1405/02/15', 2000000000.00, 'تجارت', 'زهرا و لیلا کریمی دهکردی', 'زهرا و لیلا کریمی دهکردی', '3621836994', 'ساخت', NULL, NULL, ''),
(72, '12-0307/225276', '1403/07/15', 3000000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'زمین', 'نیل قاز', '4911499192', ''),
(73, '12-0307/225278', '1403/09/15', 2500000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'زمین', NULL, NULL, ''),
(74, '12-0307/225277', '1403/08/15', 2500000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'زمین', 'نیل قاز', '4911499192', ''),
(75, '12-0307/225291', '1404/05/15', 1000000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'ساخت', 'کوهی', NULL, ''),
(76, '12-0307/225292', '1404/08/15', 1000000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'ساخت', 'شیری', NULL, ''),
(77, '12-0307/225293', '1404/11/15', 1000000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'ساخت', 'شیری', NULL, ''),
(78, '12-0307/225294', '1405/02/15', 1000000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'ساخت', NULL, NULL, ''),
(79, '12-0307/225284', '1404/02/15', 750000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'جواز', NULL, NULL, ''),
(80, '12-0307/225283', '1404/01/15', 750000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'جواز', NULL, NULL, ''),
(81, '12-0307/225282', '1403/11/15', 750000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'جواز', NULL, NULL, ''),
(82, '12-0307/225281', '1403/12/15', 750000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'جواز', NULL, NULL, ''),
(83, '12-0307/225280', '1403/10/15', 750000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'جواز', NULL, NULL, ''),
(84, '12-0307/225285', '1404/03/15', 750000000.00, 'ملی', 'سید محمد حسینی', 'سید محمد حسینی', '4899430061', 'جواز', NULL, NULL, ''),
(85, '40011/460086', '1403/10/15', 750000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'جواز', NULL, NULL, ''),
(86, '40011/460088', '1403/12/15', 750000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'جواز', NULL, NULL, ''),
(87, '40011/460089', '1404/01/15', 750000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'جواز', NULL, NULL, ''),
(88, '40011/460090', '1404/02/15', 750000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'جواز', NULL, NULL, ''),
(89, '40011/460091', '1404/03/15', 750000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'جواز', NULL, NULL, ''),
(90, '40011/460087', '1403/11/15', 750000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'جواز', 'نیل قاز', '4911499192', ''),
(91, '40011/460078', '1403/07/15', 3000000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'زمین', 'نیل قاز', '4911499192', ''),
(92, '40011/460079', '1403/08/15', 2500000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'زمین', 'نیل قاز', '4911499192', ''),
(93, '40011/460080', '1403/09/15', 2500000000.00, 'سامان', 'سیما صالح', 'فرید شاهد کاشانی', '0534691374', 'زمین', NULL, NULL, ''),
(94, '161007', '1403/12/15', 750000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'جواز', NULL, NULL, ''),
(95, '161008', '1404/01/15', 750000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'جواز', NULL, NULL, ''),
(96, '161009', '1404/02/15', 750000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'جواز', NULL, NULL, ''),
(97, '161010', '1404/03/15', 750000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'جواز', NULL, NULL, ''),
(98, '161006', '1403/11/15', 750000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'جواز', 'نیل قاز', '4911499192', ''),
(99, '12-0311/161003', '1403/07/15', 3000000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'زمین', 'نیل قاز', '4911499192', ''),
(100, '12-0311/161004', '1403/08/15', 2500000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'زمین', 'نیل قاز', '4911499192', ''),
(101, '12-0311/161005', '1403/09/15', 2500000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'زمین', NULL, NULL, ''),
(102, '12-0311/161013', '1404/05/15', 1000000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'ساخت', 'شیری', NULL, ''),
(103, '12-0311/161014', '1404/08/15', 1000000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'ساخت', 'شیری', NULL, ''),
(104, '12-0311/161015', '1404/11/15', 1000000000.00, 'ملی', 'شمس الملوک علی آبادی', 'شمس الملوک علی آبادی', '0934464901', 'ساخت', NULL, NULL, ''),
(105, '14032/453504', '1403/10/15', 750000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'جواز', NULL, NULL, ''),
(106, '14032/453506', '1403/12/15', 750000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'جواز', NULL, NULL, ''),
(107, '14032/453507', '1404/01/15', 750000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'جواز', NULL, NULL, ''),
(108, '14032/453508', '1404/02/15', 750000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'جواز', NULL, NULL, ''),
(109, '14032/453509', '1404/03/15', 750000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'جواز', NULL, NULL, ''),
(110, '14032/453505', '1403/11/15', 750000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'جواز', 'نیل قاز', '4911499192', ''),
(111, '14032/453501', '1403/07/15', 3000000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'زمین', 'نیل قاز', '4911499192', ''),
(112, '14032/453502', '1403/08/15', 2500000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'زمین', 'نیل قاز', '4911499192', ''),
(113, '14032/453503', '1403/09/15', 2500000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'زمین', NULL, NULL, ''),
(114, '14032/453510', '1404/05/15', 1000000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'ساخت', 'کوهی', NULL, ''),
(115, '14032/453511', '1404/08/15', 1000000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'ساخت', 'حسن سلطانیان', NULL, ''),
(116, '14032/453512', '1404/11/15', 1000000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'ساخت', NULL, NULL, ''),
(117, '14032/453514', '1405/02/15', 1000000000.00, 'پارسیان', 'عبدالناصر یوسف زاده', 'عبدالناصر یوسف زاده', '5359926538', 'ساخت', NULL, NULL, ''),
(118, '12-9668/846174', '1403/09/15', 1250000000.00, 'ملی', 'فاطمه یزدی', 'مجید الله وردی', '0321663195', 'زمین', NULL, NULL, ''),
(119, '12-9668/846172', '1403/07/15', 1500000000.00, 'ملی', 'فاطمه یزدی', 'مجید الله وردی', '0321663195', 'زمین', 'نیل قاز', '4911499192', ''),
(120, '12-9668/846173', '1403/08/15', 1250000000.00, 'ملی', 'فاطمه یزدی', 'مجید الله وردی', '0321663195', 'زمین', 'نیل قاز', '4911499192', ''),
(121, '0109/497456', '1403/07/15', 3000000000.00, 'سپه', 'فرشته چگینی نژاد', 'حسین چگینی نژاد', '4899883315', 'زمین', 'نیل قاز', '4911499192', ''),
(122, '0109/497457', '1403/08/15', 2500000000.00, 'سپه', 'فرشته چگینی نژاد', 'حسین چگینی نژاد', '4899883315', 'زمین', 'نیل قاز', '4911499192', ''),
(123, '0109/497458', '1403/09/15', 2500000000.00, 'سپه', 'فرشته چگینی نژاد', 'حسین چگینی نژاد', '4899883315', 'زمین', NULL, NULL, ''),
(124, '1820/149511/31', '1404/01/15', 375000000.00, 'ملت', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'جواز', NULL, NULL, ''),
(125, '1820/149512/17', '1404/02/15', 375000000.00, 'ملت', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'جواز', NULL, NULL, ''),
(126, '1820/149513/54', '1404/03/15', 375000000.00, 'ملت', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'جواز', NULL, NULL, ''),
(127, '1512/997648', '1403/10/15', 375000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'جواز', NULL, NULL, ''),
(128, '1512/997650', '1403/12/15', 375000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'جواز', NULL, NULL, ''),
(129, '1512/997649', '1403/11/15', 375000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'جواز', 'نیل قاز', '4911499192', ''),
(130, '3061/276176', '1404/05/15', 500000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'ساخت', 'کوهی', NULL, ''),
(131, '3061/276177', '1404/08/15', 500000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'ساخت', 'روح الهی', NULL, ''),
(132, '3061/276178', '1404/11/15', 500000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'ساخت', NULL, NULL, ''),
(133, '3061/276179', '1405/02/15', 500000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'ساخت', NULL, NULL, ''),
(134, '1512/997642', '1403/07/15', 3000000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'زمین', 'نیل قاز', '4911499192', ''),
(135, '1512/997644', '1403/09/15', 2500000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'زمین', NULL, NULL, ''),
(136, '1512/997643', '1403/08/15', 2500000000.00, 'صادرات', 'کاظم عبدالهی وشرکا', 'کاظم عبدالهی', '0069028176', 'زمین', 'نیل قاز', '4911499192', ''),
(137, '40322/996313', '1403/12/15', 375000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'جواز', NULL, NULL, ''),
(138, '40322/996314', '1404/01/15', 375000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'جواز', NULL, NULL, ''),
(139, '40322/996315', '1404/02/15', 375000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'جواز', NULL, NULL, ''),
(140, '40322/996316', '1404/03/15', 375000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'جواز', NULL, NULL, ''),
(141, '40322/996312', '1403/11/15', 375000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'جواز', 'نیل قاز', '4911499192', ''),
(142, '40322/996317', '1404/05/15', 500000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'ساخت', 'کوهی', NULL, ''),
(143, '40322/996318', '1404/08/15', 500000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'ساخت', 'روح الهی', NULL, ''),
(144, '40322/996319', '1404/11/15', 500000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'ساخت', NULL, NULL, ''),
(145, '40322/996320', '1405/02/15', 500000000.00, 'سامان', 'کاظم عبدالهی وشرکا', 'مهدی آذری', '0068404689', 'ساخت', NULL, NULL, ''),
(146, '1200314/109754', '1403/10/15', 750000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'جواز', NULL, NULL, ''),
(147, '1200314/109756', '1403/12/15', 750000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'جواز', NULL, NULL, ''),
(148, '1200314/109757', '1404/01/15', 750000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'جواز', NULL, NULL, ''),
(149, '1200314/109758', '1404/02/15', 750000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'جواز', NULL, NULL, ''),
(150, '1200314/109759', '1404/03/15', 750000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'جواز', NULL, NULL, ''),
(151, '1200314/109755', '1403/11/15', 750000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'جواز', 'نیل قاز', '4911499192', ''),
(152, '12-0314/109751', '1403/07/15', 3000000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'زمین', 'نیل قاز', '4911499192', ''),
(153, '12-0314/109752', '1403/08/15', 2500000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'زمین', 'نیل قاز', '4911499192', ''),
(154, '12-0314/109753', '1403/09/15', 2500000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0053965906', 'زمین', NULL, NULL, ''),
(155, '12-0314/109762', '1404/05/15', 1000000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0056922418', 'ساخت', 'شیری', NULL, ''),
(156, '12-0314/109763', '1404/08/15', 1000000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0056922418', 'ساخت', 'شیری', NULL, ''),
(157, '12-0314/109764', '1404/11/15', 1000000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0056922418', 'ساخت', 'شیری', NULL, ''),
(158, '12-0314/109765', '1405/02/15', 1000000000.00, 'ملی', 'مجید خاکساران', 'مجید خاکساران', '0056922418', 'ساخت', NULL, NULL, ''),
(159, '400030/250938', '1404/03/15', 750000000.00, 'رفاه', 'محمد نظری فر', 'فاطمه عسگری', '4819842889', 'جواز', NULL, NULL, ''),
(160, '400030/250940', '1404/01/15', 750000000.00, 'رفاه', 'محمد نظری فر', 'فاطمه عسگری', '4819842889', 'جواز', NULL, NULL, ''),
(161, '400030/250941', '1404/03/15', 750000000.00, 'رفاه', 'محمد نظری فر', 'فاطمه عسگری', '4819842889', 'جواز', NULL, NULL, ''),
(162, '400030/250942', '1404/02/15', 750000000.00, 'رفاه', 'محمد نظری فر', 'فاطمه عسگری', '4819842889', 'جواز', NULL, NULL, ''),
(163, '400030/250943', '1403/12/15', 750000000.00, 'رفاه', 'محمد نظری فر', 'فاطمه عسگری', '4819842889', 'جواز', NULL, NULL, ''),
(164, '400030/250939', '1403/11/15', 750000000.00, 'رفاه', 'محمد نظری فر', 'فاطمه عسگری', '4819842889', 'جواز', 'نیل قاز', '4911499192', ''),
(165, '12-0335/893179', '1404/05/15', 1000000000.00, 'ملی', 'محمد نظری فر', 'محمد نظری فرد', '4819842889', 'ساخت', 'کوهی', NULL, ''),
(166, '12-0335/893180', '1404/08/15', 1000000000.00, 'ملی', 'محمد نظری فر', 'محمد نظری فرد', '4819842889', 'ساخت', 'حسن سلطانیان', NULL, ''),
(167, '12-0335/893181', '1404/11/15', 1000000000.00, 'ملی', 'محمد نظری فر', 'محمد نظری فرد', '4819842889', 'ساخت', NULL, NULL, ''),
(168, '12-0335/893182', '1405/02/15', 1000000000.00, 'ملی', 'محمد نظری فر', 'محمد نظری فرد', '4819842889', 'ساخت', NULL, NULL, ''),
(169, '12-0210/029428', '1403/10/15', 750000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'جواز', NULL, NULL, ''),
(170, '12-0210/029430', '1403/12/15', 750000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'جواز', NULL, NULL, ''),
(171, '12-0210/029429', '1403/11/15', 750000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'جواز', 'نیل قاز', '4911499192', ''),
(172, '12-0210/029426', '1403/08/15', 2500000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'زمین', 'نیل قاز', '4911499192', ''),
(173, '12-0210/295652', '1403/07/15', 3000000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'زمین', 'نیل قاز', '4911499192', ''),
(174, '12-0210/029427', '1403/09/15', 2500000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'زمین', NULL, NULL, ''),
(175, '12-0210/029431', '1404/05/15', 1000000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'ساخت', 'کوهی', NULL, ''),
(176, '12-0210/029432', '1404/08/15', 1000000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'ساخت', 'شیری', NULL, ''),
(177, '12-0210/029433', '1404/11/15', 1000000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'ساخت', 'شیری', NULL, ''),
(178, '12-0210/029434', '1405/02/15', 1000000000.00, 'ملی', 'مرتضی دزفولیان', 'مرتضی دزفولیان', '1755696159', 'ساخت', NULL, NULL, ''),
(179, '1097/734866', '1403/10/15', 750000000.00, 'پاسارگاد', 'مرتضی محبی', 'مرتضی محبی', '0015236595', 'جواز', NULL, NULL, ''),
(180, '1097/734867', '1403/11/15', 750000000.00, 'پاسارگاد', 'مرتضی محبی', 'مرتضی محبی', '0015236595', 'جواز', NULL, NULL, ''),
(181, '1097/734868', '1403/12/15', 750000000.00, 'پاسارگاد', 'مرتضی محبی', 'مرتضی محبی', '0015236595', 'جواز', NULL, NULL, ''),
(182, '1021/644148', '1403/10/15', 750000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'جواز', NULL, NULL, ''),
(183, '1021/644150', '1403/12/15', 750000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'جواز', NULL, NULL, ''),
(184, '1021/644164', '1404/02/15', 750000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'جواز', NULL, NULL, ''),
(185, '1021/644165', '1404/03/15', 750000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'جواز', NULL, NULL, ''),
(186, '1021/644149', '1403/11/15', 750000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'جواز', 'نیل قاز', '4911499192', ''),
(187, '1021/644146', '1403/08/16', 2500000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'زمین', NULL, NULL, ''),
(188, '1019/318890', '1403/08/16', 3000000000.00, 'سرمایه', 'معصومه یوسفی', 'محسن یوسفی', '0047809485', 'زمین', NULL, NULL, ''),
(189, '9001/056891', '1403/10/15', 750000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'جواز', NULL, NULL, ''),
(190, '9001/056893', '1403/12/15', 750000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'جواز', NULL, NULL, ''),
(191, '9001/056894', '1404/01/15', 750000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'جواز', NULL, NULL, ''),
(192, '9001/056895', '1404/02/15', 750000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'جواز', NULL, NULL, ''),
(193, '9001/056896', '1404/03/15', 750000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'جواز', NULL, NULL, ''),
(194, '9001/056883', '1403/09/15', 2500000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'زمین', NULL, NULL, ''),
(195, '9001/056892', '1403/11/15', 750000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'جواز', 'نیل قاز', '4911499192', ''),
(196, '9001/056881', '1403/07/15', 3000000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'زمین', 'نیل قاز', '4911499192', ''),
(197, '9001/056882', '1403/08/15', 2500000000.00, 'صادرات', 'موسی مرادی و شرکا', 'موسی مرادی', '1219894966', 'زمین', 'نیل قاز', '4911499192', ''),
(198, '1872/366264/22', '1403/11/15', 750000000.00, 'ملت', 'نرجس خسروی', 'نرجس خسروی', '1141148560', 'جواز', 'نیل قاز', '4911499192', ''),
(199, '1872/366263/36', '1404/03/15', 1500000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'جواز', NULL, NULL, ''),
(200, '1872/366266/45', '1403/12/15', 1500000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'جواز', NULL, NULL, ''),
(201, '1872/366267/31', '1404/01/15', 1500000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'جواز', NULL, NULL, ''),
(202, '1872/366268/17', '1404/02/15', 1500000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'جواز', NULL, NULL, ''),
(203, '1872/366270/44', '1404/08/15', 2000000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'ساخت', 'روح الهی', NULL, ''),
(204, '1872/366269/54', '1404/11/15', 2000000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'ساخت', NULL, NULL, ''),
(205, '1872/366271/30', '1405/02/15', 2000000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'ساخت', NULL, NULL, ''),
(206, '1872/366266/45', '1403/12/15', 1500000000.00, 'ملت', 'نرجس و بهاره خسروی', 'نرجس خسروی', '1141148560', 'جواز', NULL, NULL, ''),
(207, '14013/478732', '1403/09/15', 2500000000.00, 'پارسیان', 'هادی مرادی', 'هادی اکبر نیا', '0491973780', 'زمین', NULL, NULL, ''),
(208, '14013/478730', '1403/07/15', 3000000000.00, 'پارسیان', 'هادی مرادی', 'هادی اکبر نیا', '0491973780', 'زمین', 'نیل قاز', '4911499192', ''),
(209, '14013/478731', '1403/08/15', 2500000000.00, 'پارسیان', 'هادی مرادی', 'هادی اکبر نیا', '0491973780', 'زمین', 'نیل قاز', '4911499192', '');

-- --------------------------------------------------------

--
-- Table structure for table `document_status_logs`
--

CREATE TABLE `document_status_logs` (
  `id` int NOT NULL,
  `document_id` int NOT NULL,
  `old_status` varchar(50) DEFAULT NULL,
  `new_status` varchar(50) DEFAULT NULL,
  `action` varchar(50) DEFAULT NULL,
  `reason` text,
  `admin_id` int NOT NULL,
  `change_date` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `document_status_logs`
--

INSERT INTO `document_status_logs` (`id`, `document_id`, `old_status`, `new_status`, `action`, `reason`, `admin_id`, `change_date`) VALUES
(1, 12, 'verified', 'verified', 'verify', '', 1, '2025-12-15 13:47:04'),
(2, 12, 'verified', 'verified', 'verify', '', 1, '2025-12-15 13:48:27'),
(3, 12, 'verified', 'verified', 'verify', '', 1, '2025-12-15 13:51:32'),
(4, 12, 'verified', 'verified', 'verify', '', 1, '2025-12-15 14:00:40'),
(5, 11, 'verified', 'rejected', 'reject', 'دلایل دیگر', 1, '2025-12-15 14:01:10'),
(6, 11, 'rejected', 'rejected', 'reject', 'دلایل دیگر', 1, '2025-12-15 14:02:08'),
(7, 12, 'verified', 'rejected', 'reject', 'دلایل دیگر', 1, '2025-12-15 14:02:23'),
(8, 10, 'pending', 'rejected', 'reject', 'دلایل دیگر', 1, '2025-12-15 14:03:36'),
(9, 13, 'verified', 'verified', 'verify', '', 1, '2025-12-15 15:59:32');

-- --------------------------------------------------------

--
-- Table structure for table `login_attempts`
--

CREATE TABLE `login_attempts` (
  `id` int NOT NULL,
  `ip` varchar(45) DEFAULT NULL,
  `username` varchar(100) DEFAULT NULL,
  `successful` tinyint(1) DEFAULT NULL,
  `attempt_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `login_attempts`
--

INSERT INTO `login_attempts` (`id`, `ip`, `username`, `successful`, `attempt_time`) VALUES
(1, '178.131.26.20', 'admin', 0, '2025-12-14 07:21:42');

-- --------------------------------------------------------

--
-- Table structure for table `members`
--

CREATE TABLE `members` (
  `id` int NOT NULL,
  `first_name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `national_id` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `birth_certificate_number` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `father_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `birth_date_fa` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mobile` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` text COLLATE utf8mb4_unicode_ci,
  `postal_code` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `national_card_image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `birth_certificate_image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check1_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check1_date` text COLLATE utf8mb4_unicode_ci,
  `check1_amount` decimal(15,2) DEFAULT NULL,
  `check1_bank` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check1_image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check2_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check2_date` text COLLATE utf8mb4_unicode_ci,
  `check2_amount` decimal(15,2) DEFAULT NULL,
  `check2_bank` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check2_image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check3_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check3_date` text COLLATE utf8mb4_unicode_ci,
  `check3_amount` decimal(15,2) DEFAULT NULL,
  `check3_bank` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `check3_image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `registration_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` enum('pending','approved','rejected') COLLATE utf8mb4_unicode_ci DEFAULT 'pending',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `project_id` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `members`
--

INSERT INTO `members` (`id`, `first_name`, `last_name`, `national_id`, `birth_certificate_number`, `father_name`, `birth_date`, `birth_date_fa`, `mobile`, `phone`, `address`, `postal_code`, `national_card_image`, `birth_certificate_image`, `check1_number`, `check1_date`, `check1_amount`, `check1_bank`, `check1_image`, `check2_number`, `check2_date`, `check2_amount`, `check2_bank`, `check2_image`, `check3_number`, `check3_date`, `check3_amount`, `check3_bank`, `check3_image`, `registration_date`, `ip_address`, `status`, `created_at`, `updated_at`, `project_id`) VALUES
(30, 'همایون', 'بلندیان', '0019107358', '0019107358', 'ابوالفضل', NULL, '1375/03/15', '09383488242', '02144972802', 'جنت آباد جنوبی', '8765433467', 'national_card_image_1766933946_f51931c4.jpeg', 'birth_certificate_image_1766933946_7fcbd24f.jpg', '987', '2025-12-16', 6.00, 'رسالت', 'check1_image_1766933946_3aa7c3b5.jpeg', '876', '2026-01-02', 6.00, 'پاسارگاد', 'check2_image_1766933946_fd1a5a3d.jpg', '876', '2025-12-10', 6.00, 'صادرات ایران', 'check3_image_1766933946_fba8b8b2.jpeg', '2025-12-28 14:59:06', '178.131.26.250', 'rejected', '2025-12-28 14:59:06', '2026-01-01 10:38:17', 8),
(31, 'علی', 'محمدی', '0071325182', '12345', 'محسن', NULL, '1394/06/09', '09383488242', '02188667788', '137 Teaticket Hwy', '3456788765', 'national_card_image_1767099207_acf6ab42.jpeg', 'birth_certificate_image_1767099207_fee58dd9.jpeg', '34', '2025-12-26', 5.00, 'ملت', 'check1_image_1767099207_55e53602.jpeg', '46', '2025-12-10', 3.00, 'پاسارگاد', 'check2_image_1767099207_10c171cd.jpg', '876', '2025-12-25', 5.00, 'پاسارگاد', 'check3_image_1767099207_ed8132ad.jpg', '2025-12-30 12:53:27', '178.131.26.92', 'rejected', '2025-12-30 12:53:27', '2026-01-01 10:38:23', 8),
(35, 'محمد', 'محسنی', '0321663195', '1658', 'محمد', NULL, '1391/06/15', '09126453648', NULL, '137 Teaticket Hwy', '8765432334', 'national_card_image_1767156170_d1a4c5d8.jpeg', 'birth_certificate_image_1767156170_79c7a3b0.jpg', '87', '۱۴۰۴/۱۱/۱۳', 5.00, 'رسالت', 'check1_image_1767156170_831ca907.jpeg', '۵۸۶', '۱۴۰۴/۱۰/۱۵', 5.00, 'پاسارگاد', 'check2_image_1767156170_438e8733.jpeg', '876', '۱۴۰۴/۱۰/۲۹', 6.00, 'ملت', 'check3_image_1767156170_397bb69b.jpg', '2025-12-31 04:42:50', '178.131.26.216', 'approved', '2025-12-31 04:42:50', '2026-01-04 08:12:58', 1);

-- --------------------------------------------------------

--
-- Table structure for table `projects`
--

CREATE TABLE `projects` (
  `id` int NOT NULL,
  `name` varchar(255) COLLATE utf8mb3_persian_ci NOT NULL,
  `description` text COLLATE utf8mb3_persian_ci,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

--
-- Dumping data for table `projects`
--

INSERT INTO `projects` (`id`, `name`, `description`, `created_at`) VALUES
(7, 'مهر', 'توضیحات پروژه مهر', '2025-11-12 13:14:14'),
(8, 'صدرا', 'توضیحات پروژه صدرا', '2025-12-19 16:28:30');

-- --------------------------------------------------------

--
-- Table structure for table `project_members`
--

CREATE TABLE `project_members` (
  `id` int NOT NULL,
  `share` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `introducer` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `first_name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `main_member` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `declared_share` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `national_code` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `father_name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `birth_certificate` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `birth_place` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `project_id` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `project_members`
--

INSERT INTO `project_members` (`id`, `share`, `introducer`, `first_name`, `last_name`, `main_member`, `declared_share`, `national_code`, `father_name`, `birth_certificate`, `birth_date`, `birth_place`, `phone`, `project_id`) VALUES
(1, '0/5', NULL, 'فاطمه', 'یزدی', 'اصلی', '1/2', '0321663195', 'حسین', '1174', '1385-04-14', 'کرج', '9120201412', 7),
(2, '0/5', NULL, 'ابوالفضل', 'بلندیان کاشی', 'اصلی', '1/4', '0054569109', 'رحمت اله', '2468', '1348-07-25', 'تهران', '09126028115', 7),
(3, '1', 'پویا', 'راحله السادات', 'میرعلی‌آبادی', 'اصلی', '1', '0060168420', 'سید محمد', '30313', '1359-11-10', 'تهران', NULL, 7),
(4, '0/5', NULL, 'هاشم', 'حاجی‌قاسمی', 'اصلی', '1/4', '0070646767', 'محمد', '1115', '1354-02-28', 'تهران', '09125102151', 7),
(5, '0/5', NULL, 'نرگس', 'حاجی‌قاسمی', 'اصلی', '0/5', '0055096263', 'محمد', '1658', '1348-06-15', 'تهران', '09352522240', 7),
(6, '0/25', NULL, 'یوسف', 'حاجی‌قاسمی', 'اصلی', '0/25', '0061846899', 'محمد', '9335', '1357-04-08', 'تهران', '09121547173', 7),
(7, '0/25', NULL, 'اعظم', 'خوانین‌زاده', 'اصلی', '0/25', '0018270107', 'محمد مهدی', '0018270107', '1374-05-12', 'تهران', '09102111760', 7),
(8, '1', NULL, 'هادی', 'مرادی', 'اصلی', '1', '0491973780', 'اسمعیل', '671', '1359-06-20', 'شهر ری', '09125403424', 7),
(9, '1', NULL, 'مرتضی', 'دزفولیان', 'اصلی', '1', '1755696159', 'محمد کاظم', '340', '1343-01-01', 'اهواز', '09123009715', 7),
(10, '1', NULL, 'امیدعلی', 'حیدری', 'اصلی', '1', '4869689812', 'محمد علی', '240', '1361-03-03', 'کلاله', '09124437723', 7),
(11, '1', NULL, 'حمیده', 'احمدی', 'اصلی', '1', '0071325182', 'قربانعلی', '268', '1355-01-11', 'تهران', '09120163417', 7),
(12, '1', NULL, 'زهرا', 'کریمی دهکردی', 'اصلی', '1', '4621836994', 'رحمن', '70', '1364-01-01', 'شهرکرد', '09133823296', 7),
(13, '1', 'کاشانی', 'سیما', 'صالح', 'اصلی', '1', '4419778543', 'حسن', '7768', '1366-02-14', 'دورود', '09909347718', 7),
(14, '1', NULL, 'نرجس', 'خسروی', 'اصلی', '1', '1141148560', 'علی', '649', '0000-00-00', 'خمینی شهر', '09337308401', 7),
(15, '1', NULL, 'بهاره', 'خسروی', 'اصلی', '1', '1142315711', 'علی', '9083', '1366-01-03', 'خمینی شهر', NULL, 7),
(16, '1', 'پارسا', 'فرشته', 'چگینی‌نژاد', 'اصلی', '1', '4899883315', 'مسعود', '2746', '1365-03-04', 'ساوجبلاغ', '09124606586', 7),
(17, '0/5', NULL, 'کاظم', 'عبدالهی سریزدی', 'اصلی', '0/5', '0069028176', 'حسن', '5572', '1355-06-13', 'تهران', '09121016084', 7),
(18, '0/5', NULL, 'مهدی', 'آذری کوشکی', 'اصلی', '0/5', '0068404689', 'حسن', '4086', '1362-04-22', 'تهران', '09124960987', 7),
(19, '1', NULL, 'حمیدرضا', 'نامدار ده‌بزرگی', 'اصلی', '1', '2296719880', 'هدایت', '123', '1342-02-10', 'شیراز', '09123875587', 7),
(20, '0/5', NULL, 'جواد', 'غفوری', 'اصلی', '0/5', '0071980687', 'حسن', '7358', '1361-06-29', 'تهران', '09191249062', 7),
(21, '0/5', NULL, 'رضا', 'علی‌نژاد', 'اصلی', '0/5', '0067870740', 'حکمعلی', '1838', '1358-01-22', 'تهران', '09127270499', 7),
(22, '1', NULL, 'محمد', 'نظری‌فر', 'اصلی', '1', '4819842889', 'علی', '1007', '1364-06-30', 'باغ ملک', '09163192973', 7),
(23, '1', NULL, 'جواد', 'هاشمی', 'اصلی', '1', '0035217863', 'ابراهیم', '12430', '1343-01-01', 'تهران', '09122975217', 7),
(24, '0/5', NULL, 'مرتضی', 'محبی', 'اصلی', '0/5', '0015236595', 'محمد', '0015236595', '1371-08-23', 'تهران', '09368066679', 7),
(25, '0/5', NULL, 'ریحانه', 'خوانین‌زاده', 'اصلی', '0/5', '0019695896', 'محمد مهدی', '0019695896', '1375-09-30', 'تهران', '09210954261', 7),
(26, '0/5', 'کشاورز', 'مریم', 'صادقی', 'اصلی', '0/5', '0056981813', 'علی', '2128', '1351-04-01', 'تهران', '09125786840', 7),
(27, '0/5', 'شیری', 'زهرا', 'کرمی', 'اصلی', '0/5', '0370394674', 'احمد', '0370394674', '1369-06-16', 'قم', NULL, 7),
(28, '1', NULL, 'لیلا', 'کریمی دهکردی', 'اصلی', '1', '4621640763', 'رحمن', '376', '1358-01-15', 'شهرکرد', '09126277389', 7),
(29, '1', NULL, 'نرگس', 'پرویززاده', 'اصلی', '1', '0061976441', 'حسن', '9425', '1358-06-25', 'تهران', '09120286097', 7),
(30, '1', NULL, 'معصومه', 'یوسفی', 'اصلی', '1', '0047809485', 'علی', '504', '1348-03-01', 'تهران', NULL, 7),
(31, '1', NULL, 'سید محمد', 'حسینی', 'اصلی', '1', '4899430061', 'سید شعبان', '205', '1361-09-25', 'ساوجبلاغ', '09193667691', 7),
(32, '1', 'رمضانی', 'زهرا', 'فیض', 'اصلی', '1', '0056922418', 'مسیب', '533', '1351-01-06', 'تهران', NULL, 7),
(33, '1', NULL, 'شمس الملوک', 'علی‌آبادی', 'اصلی', '1', '0934464901', 'شکر اله', '6357', '1348-09-28', 'مشهد', '09129328956', 7),
(34, '1', NULL, 'عبدالناصر', 'یوسف‌‍زاده', 'اصلی', '1', '5359926538', 'اسداله', '28', '1354-01-12', 'کوهبنان', '09021143210', 7),
(35, '0/5', NULL, 'محمد', 'مرادی', 'اصلی', '0/5', '2803597853', 'نصرت اله', '449', '1367-09-15', 'خوی', '09125159538', 7),
(36, '0/5', NULL, 'موسی', 'مرادی', 'اصلی', '0/5', '1219894966', 'نصرت اله', '1287', '1365-01-30', 'گلپایگان', '09125638736', 7),
(37, '1', NULL, 'مجید', 'خاکساران خوش', 'اصلی', '1', '0053965906', 'محمد', '7526', '1350-06-01', 'تهران', '09122466076', 7),
(38, '0/25', NULL, 'ابراهیم', 'شمس اسفند‌آبادی', 'اصلی', '0/25', '5039764545', 'احمد', '606', '1362-11-01', 'ابرکوه', '09132542675', 7),
(39, '0/25', NULL, 'مرتضی', 'کلانتر چاهوکی', 'اصلی', '0/25', '4433644625', 'محمد', '9721', '1366-06-04', 'یزد', NULL, 7),
(40, '0/25', NULL, 'شقایق', 'اکبری', 'اصلی', '0/25', '0021414564', 'اصغر', '0021414564', '1377-06-04', 'تهران', NULL, 7),
(41, '0/25', NULL, 'مجید', 'ناصرییان', 'اصلی', '0/25', '4072439975', 'حسن', '1375', '1361-09-03', 'خرم‌آباد', '09161611718', 7),
(42, NULL, NULL, 'سحر', 'حسنی', 'پیش خرید از مالک', '0/1', '0323401211', 'نصرت اله', '26131', '1367-04-29', 'کرج', '09126721402', 7),
(43, NULL, NULL, 'حماسه', 'مرادیان‌ریزی', 'پیش خرید از مالک', '0/1', '0310911389', 'احمد', '0310911389', '1372-03-25', 'کرج', NULL, 7),
(44, NULL, 'یاشار', 'نفیسه', 'حیدری', 'پیش خرید از مالک', '0/1', '0519987616', 'داود', '25', '1367-03-16', 'آشتیان', NULL, 7),
(45, NULL, NULL, 'بهنام', 'شکری', 'پیش خرید از مالک', '0/1', '0323951287', 'جعفر', '8810', '1366-03-24', 'کرج', NULL, 7),
(46, NULL, NULL, 'آئین', 'بلندیان کاشی', 'صوری 1', '0/1', '00151187561', 'ابوالفضل', '00151187561', '1385-04-14', 'تهران', '09194711950', 7),
(47, NULL, NULL, 'همایون', 'بلندیان کاشی', 'صوری 2', '0/1', '0019107358', 'ابوالفضل', '0019107358', '1375-03-15', 'تهران', '09383488242', 7),
(48, NULL, NULL, 'مرتضی', 'افشارنیا', 'صوری 3', '0/1', '4219778543', 'حسن', '7768', '1366-02-14', 'دورود', '09909347718', 7),
(49, NULL, NULL, 'محمد', 'حاجی‌قاسمی', 'صوری 4', '0/1', '4469807249', 'حیدر', '43', '1324-04-06', 'مهریز', '09126208392', 7),
(50, NULL, NULL, 'میترا', 'بختیاری', 'صوری 5', '0/1', '0323172288', 'حجت اله', '2154', '1362-01-11', 'کرج', '09125718726', 7),
(51, NULL, NULL, 'فهیمه السادات', 'میرکریم‌پور', 'صوری 6', '0/1', '0013306278', 'سید محمد', '0013306278', '1370-02-04', 'تهران', '09191688231', 7),
(52, NULL, NULL, 'عطیه', 'صالحی شهرابی', 'صوری 7', '0/1', '1263473997', 'محمد', '16151', '1367-10-27', 'کاشان', NULL, 7),
(53, NULL, NULL, 'راضیه', 'حاجی‌قاسمی', 'صوری 8', '0/1', '0059503807', 'محمد', '11301', '1351-06-20', 'تهران', NULL, 7),
(54, NULL, NULL, 'بهنام', 'عارف‌ طاهر', 'صوری 9', '0/1', '0040236749', 'عابدین', '2286', '1346-01-01', 'تهران', '09124548345', 7);

-- --------------------------------------------------------

--
-- Table structure for table `tickets`
--

CREATE TABLE `tickets` (
  `id` int NOT NULL,
  `project_id` int NOT NULL,
  `user_name` text COLLATE utf8mb3_persian_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb3_persian_ci NOT NULL,
  `admin_reply` varchar(255) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `status` enum('open','pending','closed','answered') COLLATE utf8mb3_persian_ci DEFAULT 'open',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

--
-- Dumping data for table `tickets`
--

INSERT INTO `tickets` (`id`, `project_id`, `user_name`, `title`, `admin_reply`, `status`, `created_at`, `updated_at`) VALUES
(1, 7, 'ابوالفضل بلندیان کاشی', 'عنوان برای پروژه مهر', NULL, 'answered', '2025-11-27 18:58:49', '2025-11-30 09:48:27'),
(2, 7, 'راحله السادات میرعلی‌آبادی', 'تاخیر در اجرای پروژه', 'مشکل خود کارگران هستش', 'answered', '2025-12-16 09:54:37', '2025-12-29 14:06:56'),
(3, 7, 'همایون بلندیان کاشی', 'تاخیر در پروژه', 'جهت تست', 'answered', '2025-12-29 09:31:03', '2026-02-08 12:06:31');

-- --------------------------------------------------------

--
-- Table structure for table `ticket_messages`
--

CREATE TABLE `ticket_messages` (
  `id` int NOT NULL,
  `ticket_id` int NOT NULL,
  `sender` enum('user','support','admin') COLLATE utf8mb3_persian_ci NOT NULL,
  `message` text COLLATE utf8mb3_persian_ci NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

--
-- Dumping data for table `ticket_messages`
--

INSERT INTO `ticket_messages` (`id`, `ticket_id`, `sender`, `message`, `created_at`) VALUES
(24, 1, 'user', 'سلام شب بخیر', '2025-11-27 18:59:20'),
(25, 1, 'user', 'توضیحات مربوط به پروژه مهر', '2025-11-27 18:59:39'),
(26, 1, 'admin', 'پاسخ داده شد', '2025-11-27 19:52:15'),
(27, 1, 'user', 'جواب پاسخ', '2025-11-27 20:07:12'),
(28, 1, 'admin', 'جواب پاسخ توسط مدیر', '2025-11-27 20:09:02'),
(29, 1, 'admin', 'پاسخ مجددا داده شد', '2025-11-30 09:48:27'),
(30, 2, 'user', 'سلام وقت بخیر', '2025-12-16 09:54:58'),
(31, 2, 'user', 'چرا ساختمان با تاخیر اجرا شده', '2025-12-16 09:55:28'),
(32, 3, 'user', 'سلام وقت بخیر', '2025-12-29 09:31:22'),
(33, 3, 'user', 'چرا اسکلت پروژه در زمان پیشبینی شده به اتمام نرسیده', '2025-12-29 09:31:31'),
(34, 2, 'admin', 'مشکل خود کارگران هستش', '2025-12-29 13:43:45'),
(35, 3, 'admin', 'پاسخ مشکل توسط ادمین', '2025-12-29 13:45:30'),
(36, 3, 'admin', 'جهت تست', '2026-01-07 13:08:00');

-- --------------------------------------------------------

--
-- Table structure for table `transfers`
--

CREATE TABLE `transfers` (
  `id` bigint UNSIGNED NOT NULL,
  `transfer_date` date NOT NULL COMMENT 'تاریخ حواله',
  `amount` double UNSIGNED NOT NULL COMMENT 'مبلغ حواله (ریال)',
  `bank_name` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL COMMENT 'بانک مرجع',
  `destination_account` varchar(50) COLLATE utf8mb4_persian_ci NOT NULL COMMENT 'حساب مقصد',
  `receipt_image` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL COMMENT 'مسیر تصویر حواله',
  `description` text COLLATE utf8mb4_persian_ci COMMENT 'توضیحات',
  `status` enum('pending','verified','rejected') COLLATE utf8mb4_persian_ci DEFAULT 'pending' COMMENT 'وضعیت تأیید',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `transfers`
--

INSERT INTO `transfers` (`id`, `transfer_date`, `amount`, `bank_name`, `destination_account`, `receipt_image`, `description`, `status`, `created_at`, `updated_at`) VALUES
(17, '2025-12-25', 120000000, 'saderat', '6037991890123456', 'uploads/transfers/695e0ceb5454a.jpeg', 'ندارد', 'verified', '2026-01-07 07:36:11', '2026-01-07 07:52:23'),
(21, '2026-01-17', 23000000, 'melli', '6037991890123456', 'uploads/transfers/695e10980e9be.jpg', 'ندارد', 'verified', '2026-01-07 07:51:52', '2026-01-07 07:52:11');

-- --------------------------------------------------------

--
-- Table structure for table `user_documents`
--

CREATE TABLE `user_documents` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `document_name` varchar(255) COLLATE utf8mb3_persian_ci NOT NULL,
  `document_type` varchar(255) COLLATE utf8mb3_persian_ci DEFAULT '',
  `description` text COLLATE utf8mb3_persian_ci,
  `file_path` varchar(500) COLLATE utf8mb3_persian_ci NOT NULL,
  `file_name` varchar(255) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `file_size` int NOT NULL,
  `file_type` varchar(100) COLLATE utf8mb3_persian_ci NOT NULL,
  `upload_date` datetime NOT NULL,
  `verification_status` enum('pending','verified','rejected') COLLATE utf8mb3_persian_ci DEFAULT 'pending',
  `admin_notes` text COLLATE utf8mb3_persian_ci,
  `uploaded_by_admin` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `verified_by` varchar(100) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `verification_date` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

--
-- Dumping data for table `user_documents`
--

INSERT INTO `user_documents` (`id`, `user_id`, `document_name`, `document_type`, `description`, `file_path`, `file_name`, `file_size`, `file_type`, `upload_date`, `verification_status`, `admin_notes`, `uploaded_by_admin`, `verified_by`, `verification_date`) VALUES
(18, 11, 'کارت ملی', 'کارت ملی', 'کارت ملی', '/uploads/documents/1765952463_11___________________________.JPG', 'کارت ملی احمدی.JPG', 96827, 'jpg', '2025-12-17 09:51:03', 'verified', NULL, NULL, NULL, NULL),
(19, 11, 'شناسنامه', 'شناسنامه', 'شناسنامه', '/uploads/documents/1765952510_11_____________________________1.pdf', 'شناسنامه احمدی 1.pdf', 1043129, 'pdf', '2025-12-17 09:51:50', 'verified', NULL, NULL, NULL, NULL),
(20, 47, 'national_card', 'national_card', 'ندارد', '/uploads/documents/1766034979_47_1765952144_47____________________________________________.jpeg', '1765952144_47____________________________________________.jpeg', 40490, 'jpeg', '2025-12-18 08:46:19', 'verified', NULL, NULL, NULL, NULL),
(36, 54, 'کارت ملی', 'کارت ملی', 'کارت ملی و شناسنامه', '/uploads/documents/1767598412_54_______________________________1_.pdf', 'بهنام عارف طاهر (1).pdf', 373827, 'pdf', '2026-01-05 11:03:32', 'verified', NULL, NULL, NULL, NULL),
(38, 48, 'شناسنامه', 'شناسنامه', 'شناسنامه و کارت ملی', '/uploads/documents/1767642456_48___________________________________.jpg', 'شناسنامه افشار نیا.jpg', 231688, 'jpg', '2026-01-05 23:17:37', 'verified', NULL, NULL, NULL, NULL),
(39, 54, 'شناسنامه', 'شناسنامه', '', '/uploads/documents/1771916662_54_1765952463_11___________________________.jpg', '1765952463_11___________________________.jpg', 96827, 'jpg', '2026-02-24 10:34:22', 'pending', NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `user_otps`
--

CREATE TABLE `user_otps` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `otp_code` varchar(10) COLLATE utf8mb3_persian_ci NOT NULL,
  `expires_at` datetime NOT NULL,
  `used` tinyint DEFAULT '0',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

--
-- Dumping data for table `user_otps`
--

INSERT INTO `user_otps` (`id`, `user_id`, `otp_code`, `expires_at`, `used`, `created_at`) VALUES
(1, 47, '727680', '2025-11-25 07:10:09', 0, '2025-11-25 06:00:09'),
(2, 47, '860213', '2025-11-25 07:15:14', 0, '2025-11-25 06:05:14'),
(3, 47, '431332', '2025-11-25 07:30:53', 0, '2025-11-25 06:20:53'),
(4, 47, '388103', '2025-11-25 07:45:26', 0, '2025-11-25 06:35:26'),
(5, 47, '631864', '2025-11-25 07:46:02', 0, '2025-11-25 06:36:02'),
(6, 47, '236976', '2025-11-25 09:04:31', 0, '2025-11-25 07:54:31'),
(7, 47, '757633', '2025-11-25 09:08:28', 0, '2025-11-25 07:58:28'),
(8, 1, '768141', '2025-11-25 09:10:37', 0, '2025-11-25 08:00:37'),
(9, 47, '234507', '2025-11-25 15:48:20', 0, '2025-11-25 14:38:20'),
(10, 47, '547291', '2025-11-25 15:49:56', 0, '2025-11-25 14:39:56'),
(11, 47, '711945', '2025-11-26 08:58:59', 0, '2025-11-26 07:48:59'),
(12, 47, '613379', '2025-11-26 09:00:08', 0, '2025-11-26 07:50:08'),
(13, 47, '443754', '2025-11-26 09:06:05', 0, '2025-11-26 07:56:05'),
(14, 47, '457090', '2025-11-26 09:27:48', 0, '2025-11-26 08:17:48'),
(15, 47, '772767', '2025-11-26 09:33:35', 0, '2025-11-26 08:23:35'),
(16, 47, '917531', '2025-11-26 09:39:44', 0, '2025-11-26 08:29:44'),
(17, 47, '115480', '2025-11-26 16:21:15', 0, '2025-11-26 15:11:15'),
(18, 47, '171635', '2025-11-26 16:24:03', 0, '2025-11-26 15:14:03'),
(19, 47, '631672', '2025-11-26 16:27:12', 0, '2025-11-26 15:17:12'),
(20, 47, '530356', '2025-11-27 06:58:13', 0, '2025-11-27 05:48:13'),
(21, 47, '636457', '2025-11-27 10:51:49', 0, '2025-11-27 09:41:49'),
(22, 4, '639934', '2025-11-27 10:53:20', 0, '2025-11-27 09:43:20'),
(23, 2, '151080', '2025-11-27 10:55:31', 0, '2025-11-27 09:45:31'),
(24, 12, '225673', '2025-11-27 15:54:22', 0, '2025-11-27 14:44:22'),
(25, 2, '453046', '2025-11-27 16:18:16', 0, '2025-11-27 15:08:16'),
(26, 2, '519758', '2025-11-27 17:33:11', 0, '2025-11-27 16:23:11'),
(27, 2, '809823', '2025-11-27 17:49:42', 0, '2025-11-27 16:39:42'),
(28, 2, '788110', '2025-11-27 17:55:20', 0, '2025-11-27 16:45:20'),
(29, 2, '398596', '2025-12-02 15:03:30', 0, '2025-12-02 13:53:30');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `captcha_sessions`
--
ALTER TABLE `captcha_sessions`
  ADD PRIMARY KEY (`session_id`),
  ADD KEY `idx_time` (`captcha_time`);

--
-- Indexes for table `cheques_transactions`
--
ALTER TABLE `cheques_transactions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cheque_transactions`
--
ALTER TABLE `cheque_transactions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `document_status_logs`
--
ALTER TABLE `document_status_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `login_attempts`
--
ALTER TABLE `login_attempts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `national_id` (`national_id`),
  ADD KEY `fk_members_project` (`project_id`);

--
-- Indexes for table `projects`
--
ALTER TABLE `projects`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `project_members`
--
ALTER TABLE `project_members`
  ADD PRIMARY KEY (`id`),
  ADD KEY `project_id` (`project_id`);

--
-- Indexes for table `tickets`
--
ALTER TABLE `tickets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `project_id` (`project_id`);

--
-- Indexes for table `ticket_messages`
--
ALTER TABLE `ticket_messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `ticket_id` (`ticket_id`);

--
-- Indexes for table `transfers`
--
ALTER TABLE `transfers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_documents`
--
ALTER TABLE `user_documents`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_id` (`user_id`),
  ADD KEY `idx_status` (`verification_status`);

--
-- Indexes for table `user_otps`
--
ALTER TABLE `user_otps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_id` (`user_id`),
  ADD KEY `idx_expires_at` (`expires_at`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `cheques_transactions`
--
ALTER TABLE `cheques_transactions`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=225;

--
-- AUTO_INCREMENT for table `cheque_transactions`
--
ALTER TABLE `cheque_transactions`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=210;

--
-- AUTO_INCREMENT for table `document_status_logs`
--
ALTER TABLE `document_status_logs`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `login_attempts`
--
ALTER TABLE `login_attempts`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `members`
--
ALTER TABLE `members`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT for table `projects`
--
ALTER TABLE `projects`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `tickets`
--
ALTER TABLE `tickets`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `ticket_messages`
--
ALTER TABLE `ticket_messages`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT for table `transfers`
--
ALTER TABLE `transfers`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `user_documents`
--
ALTER TABLE `user_documents`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- AUTO_INCREMENT for table `user_otps`
--
ALTER TABLE `user_otps`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `project_members`
--
ALTER TABLE `project_members`
  ADD CONSTRAINT `project_members_ibfk_1` FOREIGN KEY (`project_id`) REFERENCES `projects` (`id`);

--
-- Constraints for table `tickets`
--
ALTER TABLE `tickets`
  ADD CONSTRAINT `tickets_ibfk_1` FOREIGN KEY (`project_id`) REFERENCES `projects` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `ticket_messages`
--
ALTER TABLE `ticket_messages`
  ADD CONSTRAINT `ticket_messages_ibfk_1` FOREIGN KEY (`ticket_id`) REFERENCES `tickets` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_documents`
--
ALTER TABLE `user_documents`
  ADD CONSTRAINT `user_documents_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `project_members` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
